{
  "admin_id": 5,
  "created_by": 16,
  "created_by_role": "member",
  "response": {
    "status": true,
    "message": "Merged lecture created successfully",
    "data": {
      "lecture_id": "merged_lecture_e05f4a7e",
      "title": "Merged Lecture 20251204044619",
      "materials_count": 1,
      "topics_count": 2,
      "created_at": "2025-12-04T04:46:19.528089",
      "selected_materials": [
        "57"
      ],
      "merged_topics": [
        {
          "material_id": 57,
          "topics_count": 2,
          "topics": [
            {
              "title": "ભારતનો સાંસ્કૃતિક વારસો : પરંપરાઓ : હસ્ત અને લલિતકલા",
              "summary": "ભારત સમૃદ્ધ સાંસ્કૃતિક વારસો ધરાવતો દેશ છે. તેમાં ભૌતિક અને જૈવિક વારસાનો સમાવેશ થાય છે. બાળકને જન્મ સાથે જ મા‑બાપનાં શારીરિક અને માનસિક લક્ષણો મળે છે જેને જૈવિક વારસા તરીકે ઓળખીએ છીએ. જ્યારે ઘર, જમીન, જાગીર કે સ્થાવર‑જંગમ મિલકત વારસામાં મળે તેને ભૌતિક વારસા તરીકે ઓળખીએ છીએ. માનવી પોતાની આવડત, શક્તિ, કલા‑સર્જનને સામાન્ય રીતે સાંસ્કૃતિક વારસો કહેવાય. સમાજ‑જીવનમાં પૂર્વજો દ્વારા શરૂ થયેલી પરંપરાઓ, રૂઢિઓ, રીત‑રિવાજો અને વિશેષ જીવનશૈલીને પણ સાંસ્કૃતિક વારસા તરીકે ઓળખી શકીએ. શિક્ષણ, ખેતી, વેપાર, રોજિંદા જીવન માટેના નીતિ‑નિયમો, ઉત્સવો, મનોરંજન, કલા‑કારીગરી, માન્યતાઓ, કૌશલ્યોનો સમાવેશ પણ તેમાં થાય છે. પ્રાચીન ભારતની ચોસઠ કલાઓમાં હસ્તકલા, કારીગરી, કસબ, હુન્નર, ચિત્ર, સંગીત, નાટયકલા અને નૃત્યકલા સામેલ છે. પ્રાચીન મુદ્રાઓ મૂલ્યવાન હતી. વિદેશી પ્રવાસીઓ અને આક્રમકો માટે ભારતની સમૃદ્ધિ આકર્ષણનું કેન્દ્ર હતું. આજકાલ યોગને વિશ્વ યોગ દિવસ તરીકે 21 જૂન મનાવવામાં આવે છે.",
              "subtopics": [],
              "topic_id": "1"
            },
            {
              "title": "ભારતીય કસબીઓની કરામત",
              "summary": "ભારતનું સાંસ્કૃતિક વારસાનું સૌંદર્ય ભારતીય કારીગરો અને કસબીઓની હુન્નર પારંગતતામાં સમાયેલું છે. કારીગરોએ તેમની કલા‑કારીગરી અને હુન્નર ઉદ્યોગ દ્વારા ભારતીય જીવનને કુશળતાથી વિકસાવેલ છે. ભરત‑ગૂંથણ, કાષ્ઠકલા, માટીકામ, ધાતુકામ, ચિત્રકલા, ચર્મ ઉદ્યોગ, મીના કારીગરી, નકશીકામ, અકીક અને હીરાને લગતી કૌશલ્યપૂર્ણ કારીગરી, શિલ્પ‑સ્થાપત્ય, હાથવણાટને લગતી કારીગરી એ ભારતની આગવી ઓળખ છે.",
              "subtopics": [],
              "topic_id": "2"
            }
          ],
          "selection": {
            "selected_indices": [],
            "selected_topic_ids": [
              "1",
              "2"
            ]
          }
        }
      ]
    }
  }
}