{
  "admin_id": 5,
  "created_by": 16,
  "created_by_role": "member",
  "response": {
    "status": true,
    "message": "Merged lecture created successfully",
    "data": {
      "lecture_id": "merged_lecture_d927dc79",
      "title": "Merged Lecture 20251204042748",
      "materials_count": 1,
      "topics_count": 2,
      "created_at": "2025-12-04T04:27:48.583534",
      "selected_materials": [
        "56"
      ],
      "merged_topics": [
        {
          "material_id": 56,
          "topics_count": 2,
          "topics": [
            {
              "title": "ભારતનો સાંસ્કૃતિક વારસો",
              "summary": "",
              "subtopics": [
                {
                  "title": "પરિચય",
                  "narration": "ભારત સમૃદ્ધ સાંસ્કૃતિક વારસો ધરાવતો દેશ છે, જેમાં ભૌતિક અને જૈવિક વારસાનો સમાવેશ થાય છે. બાળકને જન્મ સાથે જ મા‑બાપનાં શારીરિક અને માનસિક લક્ષણો મળે છે જેને જૈવિક વારસા તરીકે ઓળખીએ છીએ, જ્યારે ઘર, જમીન, જાગીર કે સ્થાવર‑જંગમ મિલકત વારસામાં મળે તેને ભૌતિક વારસા તરીકે ઓળખીએ છીએ. માનવી પોતાની આવડત, શક્તિ, કલા‑કૌશલ્યોને સાંસ્કૃતિક વારસો કહેવાય છે. સમાજ‑જીવનમાં પૂર્વજો દ્વારા શરૂ થયેલી પરંપરાઓ, રૂઢિઓ, રીત‑રિવાજો અને ખાસ જીવનશૈલીને પણ સાંસ્કૃતિક વારસા તરીકે ગણાવી શકાય છે. પ્રાચીન ભારતની ચોસઠ કલાઓમાં હસ્તકલા, કારીગરી, કસબ, હુન્નર, ચિત્ર, સંગીત, નાટયકલા અને નૃત્યકલા સામેલ છે."
                }
              ],
              "topic_id": "1"
            },
            {
              "title": "હસ્ત અને લલિત કલા (હસ્તકલા)",
              "summary": "",
              "subtopics": [
                {
                  "title": "માટીકામ કલા",
                  "narration": "માનવજીવન અને માટી વચ્ચે પ્રાચીન સંબંધ રહ્યો છે; ધાતુકામની શોધ ન થયે માનવી મુખ્યત્વે માટીમાંથી રમકડાં, ઘડા, કુલડી, કોડીયાં, હાંડલા, માટીના ચૂલા અને અનાજ સંગ્રહ માટેની કોઠીઓ બનાવતો. ઘરોની દીવાલો માટી અને છાણથી લીંપીને રક્ષણ અપાતી, અને પાણી, દૂધ, દહીં, છાશ, ઘી જેવા પ્રવાહી માટીના વાસણોમાં રાખવામાં આવતાં. લોથલ, મોહેં‑જો‑દડો અને હડપ્પા સંસ્કૃતિ સમયનાં લાલ રંગનાં પવાલાં, બરણી, રકાબી જેવા વાસણો મળી આવે છે. કુંભારનો ચાકડો માટીકામ માટેનું પ્રાચીન યંત્ર ગણાય છે."
                },
                {
                  "title": "વણાટકલા",
                  "narration": "રૂની પૂણીમાંથી તાંતણા ખેંચીને તેને વળ ચડાવી લાંબો દોરો તૈયાર કરવાની કળાને વણાટ કહે છે. મહાત્મા ગાંધીજીએ કાંતણ વણાટ ગૃહ ઉદ્યોગને સ્વદેશી અને સ્વાવલંબન સાથે જોડીને ઇતિહાસ રચ્યો. પ્રાચીન સમયથી ભારત વસ્ત્ર‑વિદ્યા ક્ષેત્રે જાણીતો છે; કશ્મીર, પાટણ, રાજસ્થાનની બાંધણીઓ જેવા હાથવણાટનાં નમૂનાઓ ભારતની આગવી ઓળખ છે."
                },
                {
                  "title": "ભરત‑ગૂંથણ કલા",
                  "narration": "હડપ્પા અને મોહેં‑જો‑દડો ઉત્ખનન દરમિયાન મળેલી મૂર્તિઓ અને પૂતળાંના વસ્ત્રો ઉપર ભરત‑ગૂંથણ કામ જોવા મળ્યું. સિંધુ સંસ્કૃતિમાં સિંધ, સૌરાષ્ટ્ર અને કચ્છનાં સ્ત્રી‑પુરુષોનાં વસ્ત્રો ઉપર ભરત‑ગૂંથણ જોવા મળેલું, તેમજ કશ્મીરનું કશ્મીરી ભરત પણ જાણીતું છે. ગુજરાતમાં જામનગર, જેતપુર, ભૂજ અને માંડવી જેવા વિસ્તારોમાં પરંપરાગત શૈલીવાળી હાથી, પૂતળી, કળશ વગેરે માટે ભરત‑ગૂંથણ કલા પ્રસિદ્ધ છે."
                },
                {
                  "title": "ચર્મ ઉદ્યોગ",
                  "narration": "પ્રાચીન ભારતમાં મૃત્યુ પામેલા જાનવરોના ચામડાનો વિવિધ ઉપયોગ થતો. ચામડુ કૂવામાંથી પાણી કાઢવા, પાણીની મશકો, પખાલો, સંગીતનાં સાધનો, લુહારની ધમણો, પગરખાં, ઢાલ અને ઘોડા‑ઊંટની પીઠ ઉપર મૂકવામાં આવતાં સાજ‑પલાણમાં વપરાતો."
                },
                {
                  "title": "હીરો‑મોતીકામ અને મીનાકારીગરી",
                  "narration": "ભારતની પૂર્વ, પશ્ચિમ અને દક્ષિણ કિનારો લાંબો હોવાથી હીરા‑મોતીનો ઉપયોગ મોટા પ્રમાણમાં થતો. હીરા‑મોતીનાં આભૂષણો વિદેશોમાં માંગ ધરાવતા, કોહિનૂર અને ગ્રેટ મુઘલ હીરા પણ ભારતમાંથી મળ્યા. ગુજરાતમાં મોતીકામનું વિશેષ ઉપયોગ જોવા મળે છે; મોતીનાં તોરણો, માળાઓ, કળશ, ઘૂઘરા, પછીત, બારી, ચાકળા વગેરે કારીગરીમાં જોવા મળે છે."
                },
                {
                  "title": "જરીકામ",
                  "narration": "ચાંદી અને સોનાના તારથી જરી બનાવી, તેને ભરત‑ગૂંથણ કળા દ્વારા કિંમતી વસ્ત્રો શણગારવામાં આવે છે. સુરતમાં કુશળ કારીગરો પાનેતર, સાડી, ઘરચોળાં જેવા વસ્ત્રો પર જરીની કિનારી લગાડીને બેનમૂન કામ કરે છે."
                },
                {
                  "title": "ધાતુકામ",
                  "narration": "પાષાણ યુગ પછી ધાતુવિદ્યા વિકસિત થઈ; લોથલના કારીગરોએ તાંબાં, કાંસાં, સોનાં, ચાંદીનાં ઓજારો, દાતરડાં, શારડીઓ, વળાંકવાળી કરવત, આરા વગેરે બનાવ્યા. ધાતુમાંથી વાસણો, મૂર્તિઓ, પાત્રો, અસ્ત્રો અને શસ્ત્રો બનાવવામાં આવતાં, તેમજ સોન‑ચાંદી ઘરેણાં માટે ઉપયોગમાં લેવાતી."
                },
                {
                  "title": "કાષ્ઠકલા",
                  "narration": "પ્રારંભમાં બળતણ તરીકે અને પછી ઓજારો, ભવનો, મકાનોમાં લાકડાનો ઉપયોગ થતો. સમય સાથે લાકડાની મૂર્તિઓ, રમકડાં, સોગઠાં, થાંભલીઓ, બારી‑બારણાં, ગોખ, અટારીઓ, સિંહાસનો, ખુરશીઓ, જાળીઓ જેવી કાષ્ઠકલા વિકસિત થઈ. ગુજરાતમાં સંખેડાનું ફર્નિચર, લાકડાના હીંચકા અને ઈડરનાં રમકડાં જાણીતા છે."
                },
                {
                  "title": "જડતરંકામ",
                  "narration": "રાજાઓ, સમ્રાટો અને શ્રીમંતો દ્વારા હીરા, મોતી, માણેક જેવા કિંમતી રત્નો હાર, બાજુબંધ, કડાં, મુગટ, દામણી, વીંટી, નથણી, કાપ વગેરેમાં જડવામાં આવતાં. રાજસ્થાનનું બિકાનેર ઘરેણાંનાં જડતરંકામ માટે પ્રસિદ્ધ છે."
                },
                {
                  "title": "અકીકકામ",
                  "narration": "અકીક, ચકમક અને અર્ધપારદર્શક પથ્થરો (કાર્નેલિયન) મુખ્ય છે; સિલિકા‑મિશ્રિત ભૂરા કે સફેદ રંગનાં (કેલ્સીડોનિક) પથ્થરોને સિલ્સ તરીકે ઓળખવામાં આવે છે. ગુજરાતમાં સુરત અને રાણપુર વિસ્તારોમાં અકીકનાં પથ્થરો મળી આવે છે, જેને ખંભાત કારીગરો વિવિધ અલંકારોમાં જડવા માટે પ્રોસેસ કરે છે."
                },
                {
                  "title": "ચિત્રકલા",
                  "narration": "રંગ અને રેખાઓ દ્વારા કલા અને સૌંદર્યનું રસપાન કરાવતી ચિત્રકલા પ્રકૃતિનાં જડ અને ચૈતન્ય સ્વરૂપોમાં રહેલા વિવિધ ભાવોનું દર્શન કરે છે. હડપ્પીયન સંસ્કૃતિ, પાષણયુગની ગુફાચિત્રો, મધ્યપ્રદેશનાં હાથી, ગેંડો, હરણનાં ચિત્રો, અજંટા‑ઈલોરાના ચિત્રો ભારતીય ચિત્રકલા ના મહત્વપૂર્ણ નમૂનાઓ છે."
                }
              ],
              "topic_id": "2"
            }
          ],
          "selection": {
            "selected_indices": [],
            "selected_topic_ids": [
              "1",
              "2"
            ]
          }
        }
      ]
    }
  }
}